Documents/УстановкаПараметровРасчетаНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаПараметровРасчетаНалогаНаИмущество</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОценочнаяСтоимостьПоВидамМатериалов</xr:Item>
				<xr:Item>InformationRegister.СтавкиНалогаНаТранспорт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Недвижимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидМатериалаСтен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМатериаловСтен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТранспорта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТранспортаПоНалогуНаИмущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаПараметровРасчетаНалогаНаИмущество/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

Процедура СформироватьТаблицаСтавкиНалогаНаТранспорт(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Период,
		|	ТаблицаДокумента.ВидТранспорта,
		|	ТаблицаДокумента.ОтЛет,
		|	ТаблицаДокумента.ДоЛет,
		|	ТаблицаДокумента.Ставка
		|ИЗ
		|	ВременнаяТаблицаСтавкиНалогаНаТранспорт КАК ТаблицаДокумента";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтавкиНалогаНаТранспорт", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры      

Процедура СформироватьТаблицаОценочнаяСтоимостьПоВидамМатериалов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Период,
		|	ТаблицаДокумента.ВидМатериала КАК МатериалСтен,
		|	ТаблицаДокумента.ОтЛет,
		|	ТаблицаДокумента.ДоЛет,
		|	ТаблицаДокумента.Стоимость
		|ИЗ
		|	ВременнаяТаблицаОценочнаяСтоимостьПоВидамМатериалов КАК ТаблицаДокумента";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОценочнаяСтоимостьПоВидамМатериалов", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры   

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = "";  
	
	Запрос.Текст =
			"ВЫБРАТЬ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ссылка.Дата КАК Период,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ВидТранспорта,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ОтЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ДоЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ставка
			|ПОМЕСТИТЬ ВременнаяТаблицаСтавкиНалогаНаТранспорт
			|ИЗ
			|	Документ.УстановкаПараметровРасчетаНалогаНаИмущество.Транспорт КАК УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт
			|ГДЕ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Ссылка.Дата КАК Период,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ОтЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ДоЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ВидМатериалаСтен КАК ВидМатериала,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Стоимость
			|ПОМЕСТИТЬ ВременнаяТаблицаОценочнаяСтоимостьПоВидамМатериалов
			|ИЗ
			|	Документ.УстановкаПараметровРасчетаНалогаНаИмущество.Недвижимость КАК УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость
			|ГДЕ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
		Запрос.Выполнить();        		
	
	СформироватьТаблицаСтавкиНалогаНаТранспорт(ДокументСсылка, СтруктураДополнительныеСвойства); 
	СформироватьТаблицаОценочнаяСтоимостьПоВидамМатериалов(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли
